# ============================================================
# Brewfile — brew でしか管理できないものだけ
#
# ランタイム・CLI ツールは mise で管理 (~/.config/mise/config.toml)
# npm CLIs は pnpm (mise npm backend) で管理
# Python CLIs は uv tool で管理
# ============================================================

# ── Taps ──
tap "koekeishiya/formulae"

# ── macOS Window Management ──
brew "yabai"
brew "skhd"

# ── Editor ──
brew "neovim"
brew "tmux"

# ── Shell ──
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Git ──
brew "git-lfs"
brew "git-secrets"
brew "tig"

# ── Network / Security ──
brew "gnupg"
brew "nmap"
brew "wget"
brew "curl"
brew "telnet"

# ── System Utilities ──
brew "coreutils"
brew "grep"
brew "tree"
brew "screen"
brew "screenresolution"

# ── Media / Image Processing ──
brew "ffmpeg"
brew "imagemagick"
brew "tesseract"
brew "ghostscript"
brew "poppler"
brew "pdf2svg"

# ── Database ──
brew "mysql@5.7"
brew "postgresql@14"
brew "libpq"

# ── Build Dependencies (他の formula が依存) ──
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "libyaml"
brew "libffi"

# ── Casks ──
cask "orbstack"
